zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_VF_PCI_HDR_TYPE0.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_NETC_VF_PCI_HDR_TYPE0.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_NETC_VF_PCI_HDR_TYPE0
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_NETC_VF_PCI_HDR_TYPE0_H_)  /* Check if memory map has not been already included */
#define S32K566_NETC_VF_PCI_HDR_TYPE0_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- NETC_VF_PCI_HDR_TYPE0 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_VF_PCI_HDR_TYPE0_Peripheral_Access_Layer NETC_VF_PCI_HDR_TYPE0 Peripheral Access Layer
 * @{
 */

/** NETC_VF_PCI_HDR_TYPE0 - Register Layout Typedef */
typedef struct NETC_VF_PCI_HDR_TYPE0_Struct {
  __I  uint32_t PCI_CFH_DID_VID;                   /**< PCI device ID and vendor ID register, offset: 0x0 */
  __IO uint16_t PCI_CFH_CMD;                       /**< PCI command register, offset: 0x4 */
  __I  uint16_t PCI_CFH_STAT;                      /**< PCI status register, offset: 0x6 */
  __I  uint32_t PCI_CFH_REVID_CLASSCODE;           /**< PCI revision ID and classcode register, offset: 0x8 */
       uint8_t PCI_CFH_CL_SIZE;                    /**< PCI cache line size register, offset: 0xC */
       uint8_t PCI_CFH_LAT_TIMER;                  /**< PCI latency timer register, offset: 0xD */
  __I  uint8_t PCI_CFH_HDR_TYPE;                   /**< PCI header type register, offset: 0xE */
       uint8_t PCI_CFH_BIST;                       /**< PCI BIST register, offset: 0xF */
  __I  uint32_t PCI_CFH_BAR0;                      /**< PCI base address register 0, offset: 0x10 */
  __I  uint32_t PCI_CFH_BAR1;                      /**< PCI base address register 1, offset: 0x14 */
  __I  uint32_t PCI_CFH_BAR2;                      /**< PCI base address register 2, offset: 0x18 */
  __I  uint32_t PCI_CFH_BAR3;                      /**< PCI base address register 3, offset: 0x1C */
  __I  uint32_t PCI_CFH_BAR4;                      /**< PCI base address register 4, offset: 0x20 */
  __I  uint32_t PCI_CFH_BAR5;                      /**< PCI base address register 5, offset: 0x24 */
  __I  uint32_t PCI_CFH_CARDBUS_CIS;               /**< PCI cardbus CIS register, offset: 0x28 */
  __I  uint16_t PCI_CFH_SUBSYS_VID;                /**< PCI subsystem vendor ID register, offset: 0x2C */
  __I  uint16_t PCI_CFH_SUBSYS_ID;                 /**< PCI subsystem ID register, offset: 0x2E */
  __I  uint32_t PCI_CFH_EXP_ROM_BA;                /**< PCI expansion ROM base address register, offset: 0x30 */
  __I  uint8_t PCI_CFH_CAP_PTR;                    /**< PCI capabilities pointer register, offset: 0x34 */
  uint8_t RESERVED_0[11];
  __I  uint16_t PCI_CFC_PCIE_CAP_LIST;             /**< PCI PCIe capabilities list register, offset: 0x40 */
  __I  uint16_t PCI_CFC_PCIE_CAP;                  /**< PCI PCIe capabilities register, offset: 0x42 */
  __I  uint32_t PCI_CFC_PCIE_DEV_CAP;              /**< PCI PCIe device capabilities register, offset: 0x44 */
  __IO uint16_t PCI_CFC_PCIE_DEV_CTL;              /**< PCI PCIe device control register, offset: 0x48 */
  __I  uint16_t PCI_CFC_PCIE_DEV_STAT;             /**< PCI PCIe device status register, offset: 0x4A */
  uint8_t RESERVED_1[24];
  __I  uint32_t PCI_CFC_PCIE_DEV_CAP2;             /**< PCI PCIe device capabilities 2 register, offset: 0x64 */
  __I  uint16_t PCI_CFC_PCIE_DEV_CTL2;             /**< PCI PCIe device control 2 register, offset: 0x68 */
  uint8_t RESERVED_2[22];
  __I  uint16_t PCI_CFC_MSIX_CAP_LIST;             /**< PCI MSI-X capabilities list register, offset: 0x80 */
  __IO uint16_t PCI_CFC_MSIX_MSG_CTL;              /**< PCI MSI-X message control register, offset: 0x82 */
  __I  uint32_t PCI_CFC_MSIX_TABLE_OFF_BIR;        /**< PCI MSI-X table offset/BIR register, offset: 0x84 */
  __I  uint32_t PCI_CFC_MSIX_PBA_OFF_BIR;          /**< PCI MSI-X PBA offset/BIR register, offset: 0x88 */
  uint8_t RESERVED_3[116];
  __I  uint32_t PCIE_CFC_AER_EXT_CAP_HDR;          /**< PCIe AER extended capability header, offset: 0x100 */
  __IO uint32_t PCIE_CFC_AER_UCORR_ERR_STAT;       /**< PCIe AER uncorrectable error status register, offset: 0x104 */
  __IO uint32_t PCIE_CFC_AER_UCORR_ERR_MASK;       /**< PCIe AER uncorrectable error mask register, offset: 0x108 */
  __IO uint32_t PCIE_CFC_AER_UCORR_ERR_SEV;        /**< PCIe AER uncorrectable error severity register, offset: 0x10C */
  __IO uint32_t PCIE_CFC_AER_CORR_ERR_STAT;        /**< PCIe AER correctable error status register, offset: 0x110 */
  __IO uint32_t PCIE_CFC_AER_CORR_ERR_MASK;        /**< PCIe AER correctable error mask register, offset: 0x114 */
  __I  uint32_t PCIE_CFC_AER_CAP_CTL;              /**< PCIe AER capabilities and control register, offset: 0x118 */
  uint8_t RESERVED_4[20];
  __I  uint32_t PCIE_CFC_ACS_CAP_HDR;              /**< PCIe ACS capability header, offset: 0x130 */
  __I  uint16_t PCIE_CFC_ACS_CAP;                  /**< PCIe ACS capability register, offset: 0x134 */
  __I  uint16_t PCIE_CFC_ACS_CTL;                  /**< PCIe ACS control register, offset: 0x136 */
  uint8_t RESERVED_5[8];
  __I  uint32_t PCIE_CFC_RTR_CAP_HDR;              /**< PCIe readiness time reporting capability header, offset: 0x140 */
  __I  uint32_t PCIE_CFC_RTR_RTR1;                 /**< PCIe RTR readiness time reporting 1 register, offset: 0x144 */
  __I  uint32_t PCIE_CFC_RTR_RTR2;                 /**< PCIe RTR readiness time reporting 2 register, offset: 0x148 */
} NETC_VF_PCI_HDR_TYPE0_Type, *NETC_VF_PCI_HDR_TYPE0_MemMapPtr;

/** Number of instances of the NETC_VF_PCI_HDR_TYPE0 module. */
#define NETC_VF_PCI_HDR_TYPE0_INSTANCE_COUNT     (5u)

/* NETC_VF_PCI_HDR_TYPE0 - Peripheral instance base addresses */
/** Peripheral NETC__VF1_PCI_HDR_TYPE0 base address */
#define IP_NETC__VF1_PCI_HDR_TYPE0_BASE          (0x6D440000u)
/** Peripheral NETC__VF1_PCI_HDR_TYPE0 base pointer */
#define IP_NETC__VF1_PCI_HDR_TYPE0               ((NETC_VF_PCI_HDR_TYPE0_Type *)IP_NETC__VF1_PCI_HDR_TYPE0_BASE)
/** Peripheral NETC__VF2_PCI_HDR_TYPE0 base address */
#define IP_NETC__VF2_PCI_HDR_TYPE0_BASE          (0x6D480000u)
/** Peripheral NETC__VF2_PCI_HDR_TYPE0 base pointer */
#define IP_NETC__VF2_PCI_HDR_TYPE0               ((NETC_VF_PCI_HDR_TYPE0_Type *)IP_NETC__VF2_PCI_HDR_TYPE0_BASE)
/** Peripheral NETC__VF3_PCI_HDR_TYPE0 base address */
#define IP_NETC__VF3_PCI_HDR_TYPE0_BASE          (0x6D4C0000u)
/** Peripheral NETC__VF3_PCI_HDR_TYPE0 base pointer */
#define IP_NETC__VF3_PCI_HDR_TYPE0               ((NETC_VF_PCI_HDR_TYPE0_Type *)IP_NETC__VF3_PCI_HDR_TYPE0_BASE)
/** Peripheral NETC__VF4_PCI_HDR_TYPE0 base address */
#define IP_NETC__VF4_PCI_HDR_TYPE0_BASE          (0x6D500000u)
/** Peripheral NETC__VF4_PCI_HDR_TYPE0 base pointer */
#define IP_NETC__VF4_PCI_HDR_TYPE0               ((NETC_VF_PCI_HDR_TYPE0_Type *)IP_NETC__VF4_PCI_HDR_TYPE0_BASE)
/** Peripheral NETC__VF5_PCI_HDR_TYPE0 base address */
#define IP_NETC__VF5_PCI_HDR_TYPE0_BASE          (0x6D540000u)
/** Peripheral NETC__VF5_PCI_HDR_TYPE0 base pointer */
#define IP_NETC__VF5_PCI_HDR_TYPE0               ((NETC_VF_PCI_HDR_TYPE0_Type *)IP_NETC__VF5_PCI_HDR_TYPE0_BASE)
/** Array initializer of NETC_VF_PCI_HDR_TYPE0 peripheral base addresses */
#define IP_NETC_VF_PCI_HDR_TYPE0_BASE_ADDRS      { IP_NETC__VF1_PCI_HDR_TYPE0_BASE, IP_NETC__VF2_PCI_HDR_TYPE0_BASE, IP_NETC__VF3_PCI_HDR_TYPE0_BASE, IP_NETC__VF4_PCI_HDR_TYPE0_BASE, IP_NETC__VF5_PCI_HDR_TYPE0_BASE }
/** Array initializer of NETC_VF_PCI_HDR_TYPE0 peripheral base pointers */
#define IP_NETC_VF_PCI_HDR_TYPE0_BASE_PTRS       { IP_NETC__VF1_PCI_HDR_TYPE0, IP_NETC__VF2_PCI_HDR_TYPE0, IP_NETC__VF3_PCI_HDR_TYPE0, IP_NETC__VF4_PCI_HDR_TYPE0, IP_NETC__VF5_PCI_HDR_TYPE0 }

/* ----------------------------------------------------------------------------
   -- NETC_VF_PCI_HDR_TYPE0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_VF_PCI_HDR_TYPE0_Register_Masks NETC_VF_PCI_HDR_TYPE0 Register Masks
 * @{
 */

/*! @name PCI_CFH_DID_VID - PCI device ID and vendor ID register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_DID_VID_VENDOR_ID_MASK (0xFFFFU)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_DID_VID_VENDOR_ID_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_DID_VID_VENDOR_ID_WIDTH (16U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_DID_VID_VENDOR_ID(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_DID_VID_VENDOR_ID_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_DID_VID_VENDOR_ID_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_DID_VID_DEVICE_ID_MASK (0xFFFF0000U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_DID_VID_DEVICE_ID_SHIFT (16U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_DID_VID_DEVICE_ID_WIDTH (16U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_DID_VID_DEVICE_ID(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_DID_VID_DEVICE_ID_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_DID_VID_DEVICE_ID_MASK)
/*! @} */

/*! @name PCI_CFH_CMD - PCI command register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK (0x4U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_SHIFT (2U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN(x) (((uint16_t)(((uint16_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK)
/*! @} */

/*! @name PCI_CFH_STAT - PCI status register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_STAT_CAP_LIST_MASK (0x10U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_STAT_CAP_LIST_SHIFT (4U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_STAT_CAP_LIST_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_STAT_CAP_LIST(x) (((uint16_t)(((uint16_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_STAT_CAP_LIST_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_STAT_CAP_LIST_MASK)
/*! @} */

/*! @name PCI_CFH_REVID_CLASSCODE - PCI revision ID and classcode register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_REV_ID_MASK (0xFFU)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_REV_ID_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_REV_ID_WIDTH (8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_REV_ID(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_REV_ID_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_REV_ID_MASK)

