zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_VF_PCI_HDR_TYPE0.h
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_MASK (0xFFFFFF00U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_SHIFT (8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_WIDTH (24U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_MASK)
/*! @} */

/*! @name PCI_CFH_CL_SIZE - PCI cache line size register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_MASK (0xFFU)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_WIDTH (8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE(x) (((uint8_t)(((uint8_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_MASK)
/*! @} */

/*! @name PCI_CFH_LAT_TIMER - PCI latency timer register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_LAT_TIMER_LATENCY_TIMER_MASK (0xFFU)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_LAT_TIMER_LATENCY_TIMER_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_LAT_TIMER_LATENCY_TIMER_WIDTH (8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_LAT_TIMER_LATENCY_TIMER(x) (((uint8_t)(((uint8_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_LAT_TIMER_LATENCY_TIMER_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_LAT_TIMER_LATENCY_TIMER_MASK)
/*! @} */

/*! @name PCI_CFH_HDR_TYPE - PCI header type register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_MASK (0x7FU)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_WIDTH (7U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE(x) (((uint8_t)(((uint8_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_MASK (0x80U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_SHIFT (7U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV(x) (((uint8_t)(((uint8_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_MASK)
/*! @} */

/*! @name PCI_CFH_BIST - PCI BIST register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BIST_BIST_MASK (0xFFU)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BIST_BIST_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BIST_BIST_WIDTH (8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BIST_BIST(x) (((uint8_t)(((uint8_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BIST_BIST_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BIST_BIST_MASK)
/*! @} */

/*! @name PCI_CFH_BAR0 - PCI base address register 0 */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_MASK (0x1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_TYPE_MASK (0x6U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_TYPE_SHIFT (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_TYPE_WIDTH (2U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_TYPE_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_TYPE_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_PF_MEM_MASK (0x8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_PF_MEM_SHIFT (3U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_PF_MEM_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_PF_MEM_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_PF_MEM_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_ADDR_MASK (0xFFFFFFF0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_ADDR_SHIFT (4U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_ADDR_WIDTH (28U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_ADDR(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_ADDR_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR0_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR1 - PCI base address register 1 */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_MASK (0x1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_TYPE_MASK (0x6U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_TYPE_SHIFT (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_TYPE_WIDTH (2U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_TYPE_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_TYPE_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_PF_MEM_MASK (0x8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_PF_MEM_SHIFT (3U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_PF_MEM_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_PF_MEM_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_PF_MEM_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_ADDR_MASK (0xFFFFFFF0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_ADDR_SHIFT (4U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_ADDR_WIDTH (28U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_ADDR(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_ADDR_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR1_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR2 - PCI base address register 2 */
/*! @{ */

