zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_VF_PCI_HDR_TYPE0.h
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_MASK (0x1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_TYPE_MASK (0x6U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_TYPE_SHIFT (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_TYPE_WIDTH (2U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_TYPE_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_TYPE_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_PF_MEM_MASK (0x8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_PF_MEM_SHIFT (3U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_PF_MEM_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_PF_MEM_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_PF_MEM_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_ADDR_MASK (0xFFFFFFF0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_ADDR_SHIFT (4U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_ADDR_WIDTH (28U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_ADDR(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_ADDR_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR2_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR3 - PCI base address register 3 */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_MASK (0x1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_TYPE_MASK (0x6U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_TYPE_SHIFT (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_TYPE_WIDTH (2U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_TYPE_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_TYPE_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_PF_MEM_MASK (0x8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_PF_MEM_SHIFT (3U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_PF_MEM_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_PF_MEM_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_PF_MEM_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_ADDR_MASK (0xFFFFFFF0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_ADDR_SHIFT (4U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_ADDR_WIDTH (28U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_ADDR(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_ADDR_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR3_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR4 - PCI base address register 4 */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_MASK (0x1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_TYPE_MASK (0x6U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_TYPE_SHIFT (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_TYPE_WIDTH (2U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_TYPE_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_TYPE_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_PF_MEM_MASK (0x8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_PF_MEM_SHIFT (3U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_PF_MEM_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_PF_MEM_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_PF_MEM_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_ADDR_MASK (0xFFFFFFF0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_ADDR_SHIFT (4U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_ADDR_WIDTH (28U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_ADDR(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_ADDR_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR4_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR5 - PCI base address register 5 */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_MASK (0x1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_TYPE_MASK (0x6U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_TYPE_SHIFT (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_TYPE_WIDTH (2U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_TYPE_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_TYPE_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_PF_MEM_MASK (0x8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_PF_MEM_SHIFT (3U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_PF_MEM_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_PF_MEM_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_PF_MEM_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_ADDR_MASK (0xFFFFFFF0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_ADDR_SHIFT (4U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_ADDR_WIDTH (28U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_ADDR(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_ADDR_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_BAR5_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_CARDBUS_CIS - PCI cardbus CIS register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CARDBUS_CIS_CARDBUS_CIS_PTR_MASK (0xFFFFFFFFU)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CARDBUS_CIS_CARDBUS_CIS_PTR_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CARDBUS_CIS_CARDBUS_CIS_PTR_WIDTH (32U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CARDBUS_CIS_CARDBUS_CIS_PTR(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CARDBUS_CIS_CARDBUS_CIS_PTR_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFH_CARDBUS_CIS_CARDBUS_CIS_PTR_MASK)
/*! @} */

