zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_VF_PCI_HDR_TYPE0.h
/*! @name PCI_CFC_PCIE_DEV_CAP2 - PCI PCIe device capabilities 2 register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP2_CMPL_TO_RNG_SUPP_MASK (0xFU)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP2_CMPL_TO_RNG_SUPP_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP2_CMPL_TO_RNG_SUPP_WIDTH (4U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP2_CMPL_TO_RNG_SUPP(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP2_CMPL_TO_RNG_SUPP_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP2_CMPL_TO_RNG_SUPP_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP2_CMPL_TO_DIS_SUPP_MASK (0x10U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP2_CMPL_TO_DIS_SUPP_SHIFT (4U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP2_CMPL_TO_DIS_SUPP_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP2_CMPL_TO_DIS_SUPP(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP2_CMPL_TO_DIS_SUPP_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP2_CMPL_TO_DIS_SUPP_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_DEV_CTL2 - PCI PCIe device control 2 register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL2_CMPL_TO_VALUE_MASK (0xFU)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL2_CMPL_TO_VALUE_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL2_CMPL_TO_VALUE_WIDTH (4U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL2_CMPL_TO_VALUE(x) (((uint16_t)(((uint16_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL2_CMPL_TO_VALUE_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL2_CMPL_TO_VALUE_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL2_CMPL_TO_EN_MASK (0x10U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL2_CMPL_TO_EN_SHIFT (4U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL2_CMPL_TO_EN_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL2_CMPL_TO_EN(x) (((uint16_t)(((uint16_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL2_CMPL_TO_EN_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL2_CMPL_TO_EN_MASK)
/*! @} */

/*! @name PCI_CFC_MSIX_CAP_LIST - PCI MSI-X capabilities list register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_CAP_LIST_CAP_ID_MASK (0xFFU)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_CAP_LIST_CAP_ID_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_CAP_LIST_CAP_ID_WIDTH (8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_CAP_LIST_CAP_ID(x) (((uint16_t)(((uint16_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_CAP_LIST_CAP_ID_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_CAP_LIST_CAP_ID_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_CAP_LIST_NEXT_CAP_PTR_MASK (0xFF00U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_CAP_LIST_NEXT_CAP_PTR_SHIFT (8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_CAP_LIST_NEXT_CAP_PTR_WIDTH (8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_CAP_LIST_NEXT_CAP_PTR(x) (((uint16_t)(((uint16_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_CAP_LIST_NEXT_CAP_PTR_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_CAP_LIST_NEXT_CAP_PTR_MASK)
/*! @} */

/*! @name PCI_CFC_MSIX_MSG_CTL - PCI MSI-X message control register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_TABLE_SIZE_MASK (0x7FFU)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_TABLE_SIZE_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_TABLE_SIZE_WIDTH (11U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_TABLE_SIZE(x) (((uint16_t)(((uint16_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_TABLE_SIZE_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_TABLE_SIZE_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK (0x4000U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_SHIFT (14U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK(x) (((uint16_t)(((uint16_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN_MASK (0x8000U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN_SHIFT (15U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN_WIDTH (1U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN(x) (((uint16_t)(((uint16_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN_MASK)
/*! @} */

/*! @name PCI_CFC_MSIX_TABLE_OFF_BIR - PCI MSI-X table offset/BIR register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_TABLE_OFF_BIR_TABLE_BIR_MASK (0x7U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_TABLE_OFF_BIR_TABLE_BIR_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_TABLE_OFF_BIR_TABLE_BIR_WIDTH (3U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_TABLE_OFF_BIR_TABLE_BIR(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_TABLE_OFF_BIR_TABLE_BIR_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_TABLE_OFF_BIR_TABLE_BIR_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_TABLE_OFF_BIR_TABLE_OFFSET_MASK (0xFFFFFFF8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_TABLE_OFF_BIR_TABLE_OFFSET_SHIFT (3U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_TABLE_OFF_BIR_TABLE_OFFSET_WIDTH (29U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_TABLE_OFF_BIR_TABLE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_TABLE_OFF_BIR_TABLE_OFFSET_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_TABLE_OFF_BIR_TABLE_OFFSET_MASK)
/*! @} */

/*! @name PCI_CFC_MSIX_PBA_OFF_BIR - PCI MSI-X PBA offset/BIR register */
/*! @{ */

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_BIR_MASK (0x7U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_BIR_SHIFT (0U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_BIR_WIDTH (3U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_BIR(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_BIR_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_BIR_MASK)

#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_OFFSET_MASK (0xFFFFFFF8U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_OFFSET_SHIFT (3U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_OFFSET_WIDTH (29U)
#define NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_OFFSET_SHIFT)) & NETC_VF_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_OFFSET_MASK)
/*! @} */

/*! @name PCIE_CFC_AER_EXT_CAP_HDR - PCIe AER extended capability header */
/*! @{ */

